tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1459_tdd.h
#define G1IS0                         522
#define G1IS                          523
#define G1IS1                         524
#define G1ASDLA                       525
#define G1ASDLA0                      526
#define G1ASDLA1                      527
#define G1ASDLB                       528
#define G1ASDLB0                      529
#define G1ASDLB1                      530
#define CWG1CON2                      531
#define G1ASDSFLT                     532
#define G1ASDSC1                      533
#define G1ASDSC2                      534
#define G1ARSEN                       535
#define G1ASE                         536
#define UCON                          537
#define SUSPND                        538
#define RESUME                        539
#define USBEN                         540
#define PKTDIS                        541
#define SE0                           542
#define PPBRST                        543
#define USTAT                         544
#define PPBI                          545
#define DIR                           546
#define ENDP                          547
#define ENDP0                         548
#define ENDP1                         549
#define ENDP2                         550
#define ENDP3                         551
#define UIR                           552
#define URSTIF                        553
#define UERRIF                        554
#define ACTVIF                        555
#define TRNIF                         556
#define IDLEIF                        557
#define STALLIF                       558
#define SOFIF                         559
#define UCFG                          560
#define PPB                           561
#define PPB0                          562
#define PPB1                          563
#define FSEN                          564
#define UPUEN                         565
#define UTEYE                         566
#define UIE                           567
#define URSTIE                        568
#define UERRIE                        569
#define ACTVIE                        570
#define TRNIE                         571
#define IDLEIE                        572
#define STALLIE                       573
#define SOFIE                         574
#define UEIR                          575
#define PIDEF                         576
#define CRC5EF                        577
#define CRC16EF                       578
#define DFN8EF                        579
#define BTOEF                         580
#define BTSEF                         581
#define UFRMH                         582
#define FRM8                          583
#define FRM9                          584
#define FRM10                         585
#define UFRML                         586
#define FRM0                          587
#define FRM1                          588
#define FRM2                          589
#define FRM3                          590
#define FRM4                          591
#define FRM5                          592
#define FRM6                          593
#define FRM7                          594
#define UADDR                         595
#define ADDR0                         596
#define ADDR1                         597
#define ADDR2                         598
#define ADDR3                         599
#define ADDR4                         600
#define ADDR5                         601
#define ADDR6                         602
#define UEIE                          603
#define PIDEE                         604
#define CRC5EE                        605
#define CRC16EE                       606
#define DFN8EE                        607
#define BTOEE                         608
#define BTSEE                         609
#define UEP0                          610
#define UEP0_EPSTALL                  611
#define UEP0_EPINEN                   612
#define UEP0_EPOUTEN                  613
#define UEP0_EPCONDIS                 614
#define UEP0_EPHSHK                   615
#define UEP1                          616
#define UEP1_EPSTALL                  617
#define UEP1_EPINEN                   618
#define UEP1_EPOUTEN                  619
#define UEP1_EPCONDIS                 620
#define UEP1_EPHSHK                   621
#define UEP2                          622
#define UEP2_EPSTALL                  623
#define UEP2_EPINEN                   624
#define UEP2_EPOUTEN                  625
#define UEP2_EPCONDIS                 626
#define UEP2_EPHSHK                   627
#define UEP3                          628
#define UEP3_EPSTALL                  629
#define UEP3_EPINEN                   630
#define UEP3_EPOUTEN                  631
#define UEP3_EPCONDIS                 632
#define UEP3_EPHSHK                   633
#define UEP4                          634
#define UEP4_EPSTALL                  635
#define UEP4_EPINEN                   636
#define UEP4_EPOUTEN                  637
#define UEP4_EPCONDIS                 638
#define UEP4_EPHSHK                   639
#define UEP5                          640
#define UEP5_EPSTALL                  641
#define UEP5_EPINEN                   642
#define UEP5_EPOUTEN                  643
#define UEP5_EPCONDIS                 644
#define UEP5_EPHSHK                   645
#define UEP6                          646
#define UEP6_EPSTALL                  647
#define UEP6_EPINEN                   648
#define UEP6_EPOUTEN                  649
#define UEP6_EPCONDIS                 650
#define UEP6_EPHSHK                   651
#define UEP7                          652
#define UEP7_EPSTALL                  653
#define UEP7_EPINEN                   654
#define UEP7_EPOUTEN                  655
#define UEP7_EPCONDIS                 656
#define UEP7_EPHSHK                   657
#define STATUS_SHAD                   658
#define STATUS_SHAD_C                 659
#define STATUS_SHAD_DC                660
#define STATUS_SHAD_Z                 661
#define WREG_SHAD                     662
#define BSR_SHAD                      663
#define PCLATH_SHAD                   664
#define FSR0L_SHAD                    665
#define FSR0H_SHAD                    666
#define FSR1L_SHAD                    667
#define FSR1H_SHAD                    668
#define STKPTR                        669
#define TOSL                          670
#define TOSH                          671

#endif // _PIC16LF1459_H_
